[
  {
  "author": "Frej",
  "created": "2022-03-12",
  "title": "Opt-in Credit Block Service - built with Node.JS, PostgreSQL, and BankId",
  "slug": "credit-block-service",
  "categories": ["Technology"],
  "coverImageUrl": "https://images.unsplash.com/photo-1554224155-6726b3ff858f?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1311&q=80",
  "coverImageAltText": "Lanestopp",
  "description": "Lånestopp is a novel, monolith service, making it easier for consumers to opt-out of taking on new credits.",
  "content": "\n\n\n# Opt-in Credit Block Service - built with Node.JS, PostgreSQL, and BankId \n\n\nLånestopp is a novel, monolith service, making it easier for consumers to opt-out of taking on new credits. \n\n> To view the live website, visit [lanestopp.se](https://lanestopp.se)\n\n##  Offering an opt-out to the risk of overindebtedness\nOverindebtness is a big problem in Sweden. Over 25% of the adult population has credit debt of more than 100 000 SEK (equivalent to approx. € 10 000). Sweden provides a good infrastructure for credit data and has a highly automated lending system. A consumer can apply for and receive a paid-out credit within hours through fully digital processes offered in the market. Access to credit is easy, almost as easy as signing up for an online casino. Unfortunately, these two phenomena are too often coupled with each other.\n\nTo mitigate issues with gambling addiction, the Swedish Gambling Authority introduced in the 2010s a voluntary block list, which gambling companies must screen to ensure that any customer is not on the block list before offering gambling services. This enables a gambling opt-out option for consumers. \n\nSimilarly, we believe some consumers want to opt-out of the credit system and overindebtedness. That's why we created Lånestopp, a voluntary credit block service. \n\n## About the project\n![Landing page Credit block service](https://storage.googleapis.com/andreassens.appspot.com/Lanestopp.png)\n### Consumer interface\nThe credit block service is where consumers can store their voluntary credit block, and make it available for lenders and credit brokers to access, and based on the block decline any credit application made by the consumer. Consumers authenticate on [lanestopp.se](https://lanestopp.se) with Swedish BankId and place a  3, 6, 12 months, or permanent credit block. Viewing and deleting credit blocks also requires BankId authentication. \n\n\n![Confirm credit block](https://storage.googleapis.com/andreassens.appspot.com/Lanestopp%20-%20Confirm%20credit%20block.png)\n\n### Lender interface\n\nOnly lenders and credit brokers licensed by the Swedish Financial Supervisory Authority were authorized to access the credit block. There are around 100 licensed banks, lenders, and consumer credit brokers in Sweden. Lenders can access credit blocks either through a [REST API](https://lanestopp.se/api-docs/), through a simple Admin User Interface in logged-in mode, or through temporary access to new blocks via token sent by mail each week to the lender.  \n```\ncurl --location --request POST https://api.lanestopp.se/sandbox/v1/credit-block/searches'\n--header 'Authorization: Bearer eyJ....kM' \n--data-raw '{\n\"ssn\": \"198709303070\"\n}'\n```\n*Example credit block screening Lender API request*\n\n## Tech Stack\nThe tech stack used for the credit block service was in summary\n\n- Website - NodeJS/Express application using Bootstrap framework for responsive styling\n- Authentication - Swedish BankId for consumers, and password login for Admin UI. Authentication was secured with a cookie containing a JWT token.\n- Data storage - PostgreSQL combined with in-memory caching of the credit block list to reduce API latency. \n- Lender notifications - Nodemailer with Gmail\n- Hosting - Google cloud platform, App Engine, Cloud SQL\n- Analytics - Google Data Studio\n\n## Conclusion\nLånestopp is a novel, monolith service, making it easier for consumers to opt out of taking on new credits. \n\n![Active credit block](https://storage.googleapis.com/andreassens.appspot.com/Lanestopp%20-%20Active%20Credit%20Block.png)\n"
  }
]